{
  "format": "layers-model",
  "generatedBy": "EmoEdu",
  "convertedBy": "TensorFlow.js Converter",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "emotion_model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 48, 48, 1],
              "dtype": "float32",
              "sparse": false,
              "name": "input"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 32,
              "kernel_size": [3, 3],
              "activation": "relu",
              "name": "conv1"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 7,
              "activation": "softmax",
              "name": "output"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "conv1/kernel",
          "shape": [3, 3, 1, 32],
          "dtype": "float32"
        },
        {
          "name": "conv1/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "output/kernel",
          "shape": [32, 7],
          "dtype": "float32"
        },
        {
          "name": "output/bias",
          "shape": [7],
          "dtype": "float32"
        }
      ]
    }
  ]
}